RT-Thread/rt-thread/bsp/freescale/platform/hal/src/sim/MKL14Z4/fsl_sim_hal_MKL14Z4.h
/*!
 * @brief Gets the LPSCIx transmit data source select setting.
 *
 * This function  gets the LPSCIx transmit data source select setting.
 *
 * @param base     Base address for current SIM instance.
 * @param instance     device instance.
 * @return select LPSCIx transmit data source select setting
 */
static inline sim_lpsci_txsrc_t SIM_HAL_GetLpsciTxSrcMode(SIM_Type * base, uint32_t instance)
{
    return (sim_lpsci_txsrc_t)SIM_BRD_SOPT5_UART0TXSRC(base);
}

#if FSL_FEATURE_SIM_OPT_HAS_ODE

/*!
* @brief Sets the UARTx Open Drain Enable setting.


*
* This function  enables/disables the UARTx Open Drain.
*
* @param base Register base address of SIM.
* @param instance UART instance.
* @param enable Enable/disable UARTx Open Drain


*                - True: Enable UARTx Open Drain
*                - False: Disable UARTx Open Drain
*/
void SIM_HAL_SetUartOpenDrainCmd(SIM_Type * base, uint32_t  instance, bool enable);

/*!
* @brief Gets the UARTx Open Drain Enable setting.
*
* This function  gets the UARTx Open Drain Enable setting.
*
* @param base Register base address of SIM.
* @param instance UART instance.
* @return enabled True if UARTx Open Drain is enabled.
*/
bool SIM_HAL_GetUartOpenDrainCmd(SIM_Type * base, uint32_t  instance);

/*!
* @brief Sets the LPSCIx Open Drain Enable setting.
*
* This function  enables/disables the LPSCIx Open Drain.
*
* @param base Register base address of SIM.
* @param instance LPSCI instance.
* @param enable Enable/disable LPSCIx Open Drain
*				 - True: Enable LPSCIx Open Drain
*				 - False: Disable LPSCIx Open Drain
*/
static inline void SIM_HAL_SetLpsciOpenDrainCmd(SIM_Type * base, uint32_t  instance, bool enable)
{
    SIM_BWR_SOPT5_UART0ODE(base, enable);
}

/*!
* @brief Gets the LPSCIx Open Drain Enable setting.
*
* This function  gets the LPSCIx Open Drain Enable setting.
*
* @param base Register base address of SIM.
* @param instance LPSCI instance.
* @return enabled True if LPSCIx Open Drain is enabled.
*/
static inline bool SIM_HAL_GetLpsciOpenDrainCmd(SIM_Type * base, uint32_t  instance)
{
    return (bool)SIM_BRD_SOPT5_UART0ODE(base);
}
#endif

#if FSL_FEATURE_SIM_OPT_HAS_TPM

/*!
* @brief Sets the Timer/PWM x external clock pin select setting.
*
* This function selects the source of the Timer/PWM x external clock pin select.


*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param select Timer/PWM x external clock pin select
*/

void SIM_HAL_SetTpmExternalClkPinSelMode(SIM_Type * base,
                                         uint32_t instance,
                                         sim_tpm_clk_sel_t select);

/*!
* @brief Gets the Timer/PWM x external clock pin select setting.
*
* This function  gets the Timer/PWM x external clock pin select setting.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @return Timer/PWM x external clock pin select setting
*/
sim_tpm_clk_sel_t SIM_HAL_GetTpmExternalClkPinSelMode(SIM_Type * base, uint32_t instance);

/*!
* @brief Sets the Timer/PWM x channel y input capture source select setting.
*
* This function  selects the Timer/PWM x channel y input capture source.


*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param channel      TPM channel y
* @param select Timer/PWM x channel y input capture source
*/

void SIM_HAL_SetTpmChSrcMode(SIM_Type * base,
                             uint32_t instance,
                             uint8_t channel,
                             sim_tpm_ch_src_t select);

/*!
* @brief Gets the Timer/PWM x channel y input capture source select setting.
*
* This function  gets the Timer/PWM x channel y input capture source.
*
* @param base     Base address for current SIM instance.
* @param instance     device instance.
* @param channel      TPM channel y
* @return select Timer/PWM x channel y input capture source
*/

sim_tpm_ch_src_t SIM_HAL_GetTpmChSrcMode(SIM_Type * base,
                                         uint32_t instance,
                                         uint8_t channel); 
#endif

/*!
 * @brief Gets the Kinetis Family ID in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Family ID in the System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Family ID
 */
static inline uint32_t SIM_HAL_GetFamilyId(SIM_Type * base)
{
    return SIM_BRD_SDID_FAMID(base);
}

/*!
 * @brief Gets the Kinetis Sub-Family ID in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Sub-Family ID in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Sub-Family ID
 */
static inline uint32_t SIM_HAL_GetSubFamilyId(SIM_Type * base)
{
    return SIM_BRD_SDID_SUBFAMID(base);
}

/*!
 * @brief Gets the Kinetis SeriesID in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Series ID in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Series ID
 */
static inline uint32_t SIM_HAL_GetSeriesId(SIM_Type * base)
{
    return SIM_BRD_SDID_SERIESID(base);
}

/*!
 * @brief Gets the Kinetis SramSize in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis SramSize in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis SramSize
 */
static inline uint32_t SIM_HAL_GetSramSize(SIM_Type * base)
{
    return SIM_BRD_SDID_SRAMSIZE(base);
}

/*!
 * @brief Gets the Kinetis Pincount ID in System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Pincount ID in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Pincount ID
 */
static inline uint32_t SIM_HAL_GetPinCntId(SIM_Type * base)
{
    return SIM_BRD_SDID_PINID(base);
}

/*!
 * @brief Gets the Kinetis Revision ID in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Revision ID in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Revision ID
 */
static inline uint32_t SIM_HAL_GetRevId(SIM_Type * base)
{
    return SIM_BRD_SDID_REVID(base);
}

/*!
 * @brief Gets the Kinetis Die ID in the System Device ID register (SIM_SDID).
 *
 * This function  gets the Kinetis Die ID in System Device ID register.
 *
 * @param base     Base address for current SIM instance.
 * @return id Kinetis Die ID
 */
static inline uint32_t SIM_HAL_GetDieId(SIM_Type * base)
{
    return SIM_BRD_SDID_DIEID(base);
}	

/*!
 * @brief Gets the program flash size in the Flash Configuration Register 1 (SIM_FCFG).
 *
 * This function  gets the program flash size in the Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @return size Program flash Size
 */
static inline uint32_t SIM_HAL_GetProgramFlashSize(SIM_Type * base)
{
    return SIM_BRD_FCFG1_PFSIZE(base);
}		

/*!
 * @brief Sets the Flash Doze in the Flash Configuration Register 1  (SIM_FCFG).
 *
 * This function  sets the Flash Doze in the Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @param setting Flash Doze setting
 */
static inline void SIM_HAL_SetFlashDoze(SIM_Type * base, uint32_t setting)
{
    SIM_BWR_FCFG1_FLASHDOZE(base, setting);
}

/*!
 * @brief Gets the Flash Doze in the Flash Configuration Register 1  (SIM_FCFG).
 *
 * This function  gets the Flash Doze in the Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @return setting Flash Doze setting
 */
static inline uint32_t SIM_HAL_GetFlashDoze(SIM_Type * base)
{
    return SIM_BRD_FCFG1_FLASHDOZE(base);
}

/*!
 * @brief Sets the Flash disable setting.
 *
 * This function  sets the Flash disable setting in the
 * Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @param disable      Flash disable setting
 */
static inline void SIM_HAL_SetFlashDisableCmd(SIM_Type * base, bool disable)
{
    SIM_BWR_FCFG1_FLASHDIS(base, disable);
}

/*!
 * @brief Gets the Flash disable setting.
 *
 * This function  gets the Flash disable setting in the
 * Flash Configuration Register 1.
 *
 * @param base     Base address for current SIM instance.
 * @return setting Flash disable setting
 */
static inline bool SIM_HAL_GetFlashDisableCmd(SIM_Type * base)
{
    return (bool)SIM_BRD_FCFG1_FLASHDIS(base);
}

/*!
 * @brief Gets the Flash maximum address block 0 in the Flash Configuration Register 1  (SIM_FCFG).
 *
 * This function gets the Flash maximum block 0 in Flash Configuration Register 2.
 *
 * @param base     Base address for current SIM instance.
 * @return address Flash maximum block 0 address
 */
static inline uint32_t SIM_HAL_GetFlashMaxAddrBlock0(SIM_Type * base)
{
    return SIM_BRD_FCFG2_MAXADDR0(base);
} 

#if defined(__cplusplus)
}
#endif /* __cplusplus*/

/*! @}*/

#endif /* __FSL_SIM_HAL_KL14Z4_H__*/
/*******************************************************************************
 * EOF
 ******************************************************************************/

